Revit 2026 API
ControlledApplication Methods
The ControlledApplication type exposes the following members.
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFailureDefinitionRegistry |  Returns the instance of FailureDefinitionRegistry.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetLibraryPaths |  Returns path information identifying where Revit searches for content.
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsJournalPlaying |  Determines if the application is currently in journal playback mode.
OpenSharedParameterFile
RegisterFailuresProcessor |  Registers Revit application-wide instance of Failures Processor.
SetLibraryPaths
ToString | Returns a string that represents the current object.
(Inherited from Object)
WriteJournalComment |  Writes a comment to the Revit journal file
Top
See Also
Reference
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace